{"basics":{"name":"Guglielmo Grillo","label":"PhD Student","image":"","email":"guglielmo.grillo@unitn.it","phone":"","url":"https://guglielmogrillo.com/","summary":"I am a PhD student in Physics at the University of Trento (Statistical and Biological Physics group) with a strong passion for computer science. This passion led me to choose a computational path both for my curricular and extracurricular classes during my bachelor's and Master's degrees and to work on personal projects in my free time. I’m also one of the founding members of Progetto Apollo, a scientific divulgation group operating at the University of Trento in collaboration with Arditodesìo. Since 2019 I’ve been a tutor for the University of Trento. My hobbies include video games, DMing d&d campaigns and parkour.","profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"work":[{"name":"Tutor, Teacher Assistant and Website Developer/Maintainer","position":"Tutor for the University of Trento","url":"https://nerusskyhigh.github.io/scipro/","startDate":"2019-09","endDate":"2024-06","summary":"In the in-class courses, my task as a tutor was to prepare ad-hoc exercises beforehand and then follow the students in their reasoning by providing hints and guidance toward the solution. In the laboratory courses, our job was to explain the lab experiences to the students and assist them in the data collection and analysis ensuring that they understood the underlying reasoning and scientific approach. I was assigned to the following courses:","highlights":["Feb 2024 - Sep 2024: Assigned to Scientific Programming (teacher assistant, DF)","Sep 2022 - Dec 2022: Introductory Physics Laboratory (DII), Mathematical Basis for Cognitive Sciences (CIMEC), Mathematics and Statistics I (CIBIO)","Mar 2022 - June 2022: Laboratory of Physics I with Matlab (DF), Introductory Physics Laboratory (DICAM)","Sep 2021 - Dec 2021: Introductory Physics Laboratory (DII)","Sep 2020 - Dec 2020: Mathematics and Statistics (A3C)","Sep 2019 - Jan 2020: Calculus I (DICAM), Calculus I (DIPSCO), Quantitative Methods for life-sciences (DIPSCO)"]},{"name":"Founding members of Progetto Apollo","position":"Scientific Storyteller","url":"https://www.youtube.com/@progettoapollo5626","startDate":"2017","endDate":"2022","summary":"Progetto Apollo, a scientific divulgation group operating at the University of Trento in collaboration with Arditodesìo. Some of our activities include research on a key topic or an interview with a Professor at the University of Trento to write narratives with the principles of storytelling.","highlights":["Teatro della Meraviglia (2019-today)","La Terra fatta dagli umani (Earth made by humans, 2022): a partnership with Caltech students about the beginning of the Anthropocene. The narratives were presented both in Trento and at Caltech.","EIT RAW Materials 2021","CO.SCIENZA Festival 2019","Focus Days 2019","Fisicittà 2017"]},{"name":"Internship at FBK - Fondazione Bruno Kessler","position":"Junior Scientist","startDate":"2015-07-06","endDate":"2015-07-31","summary":"The task of our two-student team was to study the effects of different NaCl concentrations on the contact angle between water droplets and various substrates (Borosilicate, Aluminium, and Soda-Lime Glass). The analysis was conducted both in the static regime, where droplets were studied at deposition and in the dynamic regime where we analyzed the contact angle as a function of time. The experience ended with a presentation held in the context of “Notte dei Ricercatori 2015”."}],"education":[{"institution":"University of Trento","location":"Trento, Italy","url":"https://sbp.physics.unitn.it/","area":"My PhD project revolves around two major parallel topics: chromatin organization and Kinetoplast DNA. The main goal of the project is the design of a polymer model to describe chromatin re-organization: the simulated data, in conjunction with experimental ones, will be used in a machine learning pipeline to predict breast cancer progression. Simltanously, I am also developing a coarse-grained model of Crithidia fasciculata DNA focused on its topological properties. As a side project, I am working on a technical article about best practices to organize a computational project.","studyType":"PhD student in the Statistical and Biological Physics group","startDate":"2023-11-01","endDate":"-"},{"institution":"University of Trento","location":"Trento, Italy","url":"https://www.physics.unitn.it/","area":"Thesis: Computational Models Of Astrocyte-Neuron Dynamics To Explain The Formation Of Working Memory (supervisor: prof. Luca Tubiana)","studyType":"Master Degree - statistical biophysics path with a focus on computational methods.","startDate":"2020-09","endDate":"2023-03","score":"110/110","courses":["Quantum Computing and Quantum Machine Learning","Advanced Computational Physics","Experimental Methods","Laboratory of Advanced Electronics (signal processing via FPGA)","Multi-Scale Methods in Soft Matter Physics","Statistical Mechanics and Statistical Field Theory."]},{"institution":"University of Trento","location":"Trento, Italy","url":"https://www.physics.unitn.it/","area":"Thesis: Emergent features: from renormalization group to artificial intelligence (supervisor: prof. Raffaello Potestio)","studyType":"Master Degree - statistical biophysics path with a focus on computational methods.","startDate":"2020-03","endDate":"2016-09","score":"94/110","courses":["Scientific Computing (fka Computer Science), Introduction to Machine Learning (fka Advanced Algorithms)","Linear Algebra I, Analysis I, II, III, and Complex Analysis, Complementary Mathematics for Quantum Mechanics","Physics I, II, and III, Analytical Mechanics, Quantum Mechanics","Physics Laboratory I (measures), II (analogue electronics and optics), and III (digital electronics)","Chemistry with Laboratory Sessions","After graduating, I took part in the course Data Science for Physicists as a listener (March-June 2020)."]}],"awards":[{"title":"Winner of the `Industrial AI Challenge 2023`","date":"2023-12-06","awarder":"Adige BLM Group / Hub Innovazione Trentino (HIT)","url":"https://www.trentinoinnovation.eu/industrial-ai-challenge-vince-il-team-al-lavoro-con-adige-spa-blm-group/","_url":"https://www.trentinoinnovation.eu/en/innovate/innovation-tools/ai-challenge/","summary":"During a timespan of  11 weeks, our team collaborated with BLM Group company, the parent firm of Adige SpA, to develop an AI planner. The model can analyze sales trends and will serve as a central point for the manufacturing workflow decision-making. The organization committee decided to award us first place in the competition after evaluating the number of challenges we encountered and the ways we solved or worked around them. Other than being responsible for data preprocessing, my role was also that of team supervisor in charge of keeping track of tasks performed by the various team members and communications with the company and the organization committee. This allowed me to gain a better understanding of how a data science project is carried out in a real-world scenario, to appreciate the importance of time and task management, and the necessity of team investment to reach a common goal."}],"certificates":[{"name":"Cyberchallenge.IT","date":"2021-06-03","issuer":"University of Trento and CINI","url":"https://europa.eu/europass/eportfolio/screen/redirect-external?url=https%253A%252F%252Fcyberchallenge.it%252Fhalloffame%252F2019","icon":"fa-solid fa-shield-halved"},{"name":"Innovation Camp Diploma","date":"2019","issuer":"University of Trento in partnership with Samsung","url":"https://europa.eu/europass/eportfolio/screen/redirect-external?url=https%253A%252F%252Fwebmagazine.unitn.it%252Fevento%252Fateneo%252F69296%252Fsamsung-innovation-camp","icon":"fa-regular fa-lightbulb"}],"publications":[{"name":"Speaker at the `Statistical Physics of Living Systems workshop`","publisher":"","releaseDate":"2023-05-05","url":"https://europa.eu/europass/eportfolio/screen/redirect-external?url=https%253A%252F%252Fsbp.physics.unitn.it%252Fstatistical-physics-of-living-systems-workshop","summary":"This two-day workshop gathered the members of the SBP group at the University of Trento and the QLS group of ICTP in Trieste to present and discuss the work carried out within both groups intending to foster tighter collaborations, address open problems, and develop strategies for future joint activities. My contribution consisted of a presentation of my master's thesis work."}],"skills":[{"name":"Python","level":"Advanced User","icon":"fa-brands fa-python","keywords":["I've been using Python 3 since 2018 for various programming purposes. My main focus is on scientific packages (NumPy and SciPy), Data Science/Machine Learning packages (Pandas, Pytorch, Sklearn), and Data Visualization (Matplotlib both for plotting and animation, Jupyter Notebook with widgets, Quarto) but I also worked on projects requiring non-scientific-oriented packages like image recognition (OpenCV's wrapper opencv-python) and text recognition packages (Tesseract's wrapper py-tesseract). When possible, I try to implement algorithms from scratch, therefore I'm also capable of avoiding the most frequent Python bottlenecks. If needed I can also work with object-oriented Python and type hints."]},{"name":"C","level":"Intermediate User","icon":"fa-solid fa-c","keywords":["I can also use C to write performant code thanks to the experience I gained during the courses Scientific Computing, Computational Physics, and Advanced Computational Physics. The course Cyberchallenge.IT and other personal readings gave me the fundamental knowledge needed to understand the low-level translation of the source code."]},{"name":"LAMMPS","level":"Intermediate User","icon":"fa-solid fa-dna"}],"languages":[{"language":"Italian","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent (C1)","icon":""}],"interests":[{"name":"Physics","icon":"fa-solid fa-tag","keywords":["Quantum Mechanics","Quantum Computing","Quantum Information","Quantum Cryptography","Quantum Communication","Quantum Teleportation"]}],"references":[{"name":"JSON Resume","icon":"fa-solid fa-laptop","reference":"I have yet to understand the purpose of this section. The standard `JSON Resume` (https://www.jsonresume.org/schema) doesn't provide any explanation about it."}],"projects":[{"name":"A Game of Life - Laboratory of Advanced Electronics","summary":"Code for the exercises and the final project for the course `Laboratory of Advanced Electronics` held by prof. Leonardo Ricci (ay. 2021-2022)","highlights":["Game of Life","FPGA"],"startDate":"2021-09","endDate":"2022-01","url":"https://github.com/NerusSkyhigh/LoAE-code"},{"name":"Machine Learning Phases of Matter - Advanced Computational Physics","summary":"This project aims to reobtain the results presented in Machine learning phases of matter (Juan Carrasquilla, Roger G. Melko) regarding the two-dimensional square Ising model. The authors show that a standard feed-forward neural network (FFNN) is a suitable tool to detect Ising's model phase transition.","startDate":"2022-06","endDate":"2022-10","url":"https://github.com/NerusSkyhigh/Machine-Learning-Phases-of-Matter"},{"name":"`Percolation - Theory and Applications` - Multi-scale methods in soft matter physics","summary":"Brief introduction to Bernoulli percolation with a review on the existence of the critical point, some slides I used to present the topic, and a Jupyter notebook containing a few interactive plot and simulations (like a Monte Carlo simulation for the critical probability) used to generate the images of the slides.","startDate":"2023-02","endDate":"2023-01","url":"https://github.com/NerusSkyhigh/percolation/"}]}